package SWUNIV.Hackathon.enumerations;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum University {
    인제대학교("인제대학교"),
    경운대학교("경운대학교"),
    한밭대학교("한밭대학교"),
    한국과학기술원("한국과학기술원"),
    전북대학교("전북대학교"),
    인하대학교("인하대학교"),
    아주대학교("아주대학교"),
    숙명여자대학교("숙명여자대학교"),
    국민대학교("국민대학교"),
    한국항공대학교("한국항공대학교"),
    삼육대학교("삼육대학교"),
    충남대학교("충남대학교"),
    전남대학교("전남대학교"),
    순천향대학교("순천향대학교"),
    성균관대학교("성균관대학교"),
    경북대학교("경북대학교"),
    경기대학교("경기대학교"),
    가천대학교("가천대학교"),
    호서대학교("호서대학교"),
    한국외국어대학교("한국외국어대학교"),
    상명대학교("상명대학교"),
    배재대학교("배재대학교"),
    동서대학교("동서대학교"),
    충북대학교("충북대학교"),
    이화여자대학교("이화여자대학교"),
    연세대학교("연세대학교"),
    안동대학교("안동대학교"),
    대구가톨릭대학교("대구가톨릭대학교"),
    제주대학교("제주대학교"),
    원광대학교("원광대학교"),
    우송대학교("우송대학교"),
    선문대학교("선문대학교"),
    동명대학교("동명대학교"),
    한양대학교("한양대학교"),
    한림대학교("한림대학교"),
    숭실대학교("숭실대학교"),
    건국대학교("건국대학교"),
    강원대학교("강원대학교"),
    한동대학교("한동대학교"),
    중앙대학교("중앙대학교"),
    조선대학교("조선대학교"),
    단국대학교("단국대학교"),
    광운대학교("광운대학교"),
    경희대학교("경희대학교"),
    서울여자대학교("서울여자대학교"),
    부산대학교("부산대학교"),
    동국대학교("동국대학교"),
    세종대학교("세종대학교"),
    서강대학교("서강대학교"),
    고려대학교("고려대학교");

    private final String value;
}
